In [1]:
import pandas as pd
d = pd.Series(range(20))
d

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

In [2]:
d.cumsum()

0       0
1       1
2       3
3       6
4      10
5      15
6      21
7      28
8      36
9      45
10     55
11     66
12     78
13     91
14    105
15    120
16    136
17    153
18    171
19    190
dtype: int64

In [3]:
#数据与索引
a = pd.Series([9,8,7,6])
a
#基于numpy

0    9
1    8
2    7
3    6
dtype: int64

In [4]:
b = pd.Series([9,8,7,6],index=['a','b','c','d'])#index可以省略
b

a    9
b    8
c    7
d    6
dtype: int64

In [5]:
s = pd.Series(25,index=['a','b','c'])#利用标量创建series  index不能省略
s

a    25
b    25
c    25
dtype: int64

In [6]:
d = pd.Series({'a':9, 'b':8, 'c':7})#利用字典创建
d

a    9
b    8
c    7
dtype: int64

In [7]:
e = pd.Series({'a':9, 'b':8, 'c':7},index=['c','a','b','d'])
e

c    7.0
a    9.0
b    8.0
d    NaN
dtype: float64

In [9]:
import numpy as np  #ndarray创建
n = pd.Series(np.arange(5))
n

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [10]:
m = pd.Series(np.arange(5),index=np.arange(9,4,-1))
m

9    0
8    1
7    2
6    3
5    4
dtype: int32

In [11]:
b.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
b.values  #numpy的array

array([9, 8, 7, 6], dtype=int64)

In [13]:
b['b']

8

In [14]:
b[1]

8

In [15]:
b[['c','d',0]]   #如果混合使用，会默认自定义

C:\Users\86186\Anaconda3\lib\site-packages\pandas\core\series.py:1152: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

c    7.0
d    6.0
0    NaN
dtype: float64

In [16]:
b[['c','d','a']]

c    7
d    6
a    9
dtype: int64

In [17]:
b[3]

6

In [18]:
b[:3]#切片包括索引和值，与numpy不同

a    9
b    8
c    7
dtype: int64

In [19]:
b[b>b.median()]

a    9
b    8
dtype: int64

In [20]:
np.exp(b)  #生成的都是Series类型

a    8103.083928
b    2980.957987
c    1096.633158
d     403.428793
dtype: float64

In [21]:
b['b']

8

In [22]:
'c' in b

True

In [23]:
0 in b

False

In [24]:
b.get('f',100) #如果不存在返回100，存在返回f

100

In [28]:
a = pd.Series([1,2,3],['c','d','e'])
a

c    1
d    2
e    3
dtype: int64

In [26]:
a + b  #自动对齐不同索引的数据

a    NaN
b    NaN
c    8.0
d    8.0
e    NaN
dtype: float64

In [29]:
b.name  #对象或者索引的名字

In [30]:
b.name = 'Series对象'
b.index.name = '索引列'

In [31]:
b

索引列
a    9
b    8
c    7
d    6
Name: Series对象, dtype: int64

In [32]:
b['a'] = 15
b.name = 'Series'

In [33]:
b.name = "new series"
b['b','c']=20
b
#一维带标签数组

索引列
a    15
b    20
c    20
d     6
Name: new series, dtype: int64

In [ ]:
#DataFrame共用相同索引的一组列构成
#index axis=0
#column axis=1

In [34]:
d = pd.DataFrame(np.arange(10).reshape(2,5))  #二维ndarray创建
d

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [35]:
#一维ndarray对象字典创建
dt = {"one":pd.Series([1,2,3],index=['a','b','c']),
      "two":pd.Series([9,8,7,6],index=['a','b','c','d'])}
d = pd.DataFrame(dt)
d

   one  two
a  1.0    9
b  2.0    8
c  3.0    7
d  NaN    6

In [36]:
pd.DataFrame(dt,index=['b','c','d'],columns=['two','three'])

   two three
b    8   NaN
c    7   NaN
d    6   NaN

In [37]:
dl = {'one':[1,2,3,4],'two':[9,8,7,6]}
d = pd.DataFrame(dl,index=['a','b','c','d'])
d

   one  two
a    1    9
b    2    8
c    3    7
d    4    6

In [67]:
dl = {'城市':['北京','上海','广州','深圳','沈阳'],
      '环比':[101.5,101.2,101.3,102.0,100.1],
      '同比':[120.7,127.3,119.4,140.9,101.4],
      '定基':[121.4,127.8,120.0,145.5,101.6]}
d = pd.DataFrame(dl,index=['c1','c2','c3','c4','c5'])
d

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5
c5  沈阳  100.1  101.4  101.6

In [40]:
d.index

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [41]:
d.columns

Index(['城市', '环比', '同比', '定基'], dtype='object')

In [42]:
d.values

array([['北京', 101.5, 120.7, 121.4],
       ['上海', 101.2, 127.3, 127.8],
       ['广州', 101.3, 119.4, 120.0],
       ['深圳', 102.0, 140.9, 145.5],
       ['沈阳', 100.1, 101.4, 101.6]], dtype=object)

In [43]:
d['同比']

c1    120.7
c2    127.3
c3    119.4
c4    140.9
c5    101.4
Name: 同比, dtype: float64

In [46]:
d.ix['c2']

C:\Users\86186\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

城市       上海
环比    101.2
同比    127.3
定基    127.8
Name: c2, dtype: object

In [47]:
d['同比']['c2']

127.3

In [ ]:
#二位带标签数组

In [61]:
d = d.reindex(index=['c5','c4','c3','c2','c1'])

In [49]:
d

    城市     环比     同比     定基
c5  沈阳  100.1  101.4  101.6
c4  深圳  102.0  140.9  145.5
c3  广州  101.3  119.4  120.0
c2  上海  101.2  127.3  127.8
c1  北京  101.5  120.7  121.4

In [62]:
d = d.reindex(columns=['同比','环比','城市','定基'])

In [63]:
d  #reindex

       同比     环比  城市     定基
c5  101.4  100.1  沈阳  101.6
c4  140.9  102.0  深圳  145.5
c3  119.4  101.3  广州  120.0
c2  127.3  101.2  上海  127.8
c1  120.7  101.5  北京  121.4

In [64]:
newc = d.columns.insert(4,'新增')
newc

Index(['同比', '环比', '城市', '定基', '新增'], dtype='object')

In [65]:
newd = d.reindex(columns=newc,fill_value=200)
newd

       同比     环比  城市     定基   新增
c5  101.4  100.1  沈阳  101.6  200
c4  140.9  102.0  深圳  145.5  200
c3  119.4  101.3  广州  120.0  200
c2  127.3  101.2  上海  127.8  200
c1  120.7  101.5  北京  121.4  200

In [69]:
nc = d.columns.delete(2)
ni = d.index.insert(5,'c0')
nd = d.reindex(index=ni,columns=nc).ffill()
nd

    城市     环比     定基
c1  北京  101.5  121.4
c2  上海  101.2  127.8
c3  广州  101.3  120.0
c4  深圳  102.0  145.5
c5  沈阳  100.1  101.6
c0  沈阳  100.1  101.6

In [70]:
d.drop('c5')

    城市     环比     同比     定基
c1  北京  101.5  120.7  121.4
c2  上海  101.2  127.3  127.8
c3  广州  101.3  119.4  120.0
c4  深圳  102.0  140.9  145.5

In [71]:
d.drop('同比',axis=1)

    城市     环比     定基
c1  北京  101.5  121.4
c2  上海  101.2  127.8
c3  广州  101.3  120.0
c4  深圳  102.0  145.5
c5  沈阳  100.1  101.6

In [72]:
a = pd.DataFrame(np.arange(12).reshape(3,4))
b = pd.DataFrame(np.arange(20).reshape(4,5))
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [73]:
b

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [74]:
a+b

      0     1     2     3   4
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [75]:
b.add(a,fill_value=100)

       0      1      2      3      4
0    0.0    2.0    4.0    6.0  104.0
1    9.0   11.0   13.0   15.0  109.0
2   18.0   20.0   22.0   24.0  114.0
3  115.0  116.0  117.0  118.0  119.0

In [77]:
a.mul(b,fill_value=0)

      0     1      2      3    4
0   0.0   1.0    4.0    9.0  0.0
1  20.0  30.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [78]:
c = pd.Series(np.arange(4))
c

0    0
1    1
2    2
3    3
dtype: int32

In [79]:
c-10

0   -10
1    -9
2    -8
3    -7
dtype: int32

In [80]:
b - c

      0     1     2     3   4
0   0.0   0.0   0.0   0.0 NaN
1   5.0   5.0   5.0   5.0 NaN
2  10.0  10.0  10.0  10.0 NaN
3  15.0  15.0  15.0  15.0 NaN

In [ ]:
#广播运算，默认作用所有元素

In [81]:
b.sub(c,axis=0)

    0   1   2   3   4
0   0   1   2   3   4
1   4   5   6   7   8
2   8   9  10  11  12
3  12  13  14  15  16

In [82]:
d = pd.DataFrame(np.arange(12,0,-1).reshape(3,4))
d

    0   1   2  3
0  12  11  10  9
1   8   7   6  5
2   4   3   2  1

In [83]:
a>d

       0      1      2      3
0  False  False  False  False
1  False  False  False   True
2   True   True   True   True

In [84]:
a==d

       0      1      2      3
0  False  False  False  False
1  False  False   True  False
2  False  False  False  False

In [85]:
a > c

       0      1      2      3
0  False  False  False  False
1   True   True   True   True
2   True   True   True   True

In [ ]:
#不同维度默认广播运算在1轴

In [86]:
c>0

0    False
1     True
2     True
3     True
dtype: bool

In [87]:
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [88]:
b.sort_index()

    0   1   2   3   4
a   5   6   7   8   9
b  15  16  17  18  19
c   0   1   2   3   4
d  10  11  12  13  14

In [89]:
b.sort_index(ascending=False)
#默认axis0轴，行

    0   1   2   3   4
d  10  11  12  13  14
c   0   1   2   3   4
b  15  16  17  18  19
a   5   6   7   8   9

In [97]:
c = b.sort_index(axis=1,ascending=False)

In [98]:
c

    4   3   2   1   0
c   4   3   2   1   0
a   9   8   7   6   5
d  14  13  12  11  10
b  19  18  17  16  15

In [99]:
c = c.sort_index()

In [100]:
c

    4   3   2   1   0
a   9   8   7   6   5
b  19  18  17  16  15
c   4   3   2   1   0
d  14  13  12  11  10

In [101]:
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])

In [102]:
c = b.sort_values(2,ascending=False)
c

    0   1   2   3   4
b  15  16  17  18  19
d  10  11  12  13  14
a   5   6   7   8   9
c   0   1   2   3   4

In [103]:
c = c.sort_values('a',axis=1,ascending=False)
c

    4   3   2   1   0
b  19  18  17  16  15
d  14  13  12  11  10
a   9   8   7   6   5
c   4   3   2   1   0

In [104]:
a = pd.DataFrame(np.arange(12).reshape(3,4),index=['a','b','c'])
b = pd.DataFrame(np.arange(20).reshape(4,5),index=['c','a','d','b'])
c = a+b
c

      0     1     2     3   4
a   5.0   7.0   9.0  11.0 NaN
b  19.0  21.0  23.0  25.0 NaN
c   8.0  10.0  12.0  14.0 NaN
d   NaN   NaN   NaN   NaN NaN

In [105]:
c.sort_values(2,ascending=False)

      0     1     2     3   4
b  19.0  21.0  23.0  25.0 NaN
c   8.0  10.0  12.0  14.0 NaN
a   5.0   7.0   9.0  11.0 NaN
d   NaN   NaN   NaN   NaN NaN

In [106]:
c.sort_values(2,ascending=True)

      0     1     2     3   4
a   5.0   7.0   9.0  11.0 NaN
c   8.0  10.0  12.0  14.0 NaN
b  19.0  21.0  23.0  25.0 NaN
d   NaN   NaN   NaN   NaN NaN

In [107]:
a = pd.Series([9,8,7,6],index=['a','b','c','d'])
a

a    9
b    8
c    7
d    6
dtype: int64

In [108]:
a.describe()

count    4.000000
mean     7.500000
std      1.290994
min      6.000000
25%      6.750000
50%      7.500000
75%      8.250000
max      9.000000
dtype: float64

In [109]:
type(a.describe())

pandas.core.series.Series

In [110]:
a.describe()['count']

4.0

In [111]:
a.describe()['max']

9.0

In [112]:
b.describe()

               0          1          2          3          4
count   4.000000   4.000000   4.000000   4.000000   4.000000
mean    7.500000   8.500000   9.500000  10.500000  11.500000
std     6.454972   6.454972   6.454972   6.454972   6.454972
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     3.750000   4.750000   5.750000   6.750000   7.750000
50%     7.500000   8.500000   9.500000  10.500000  11.500000
75%    11.250000  12.250000  13.250000  14.250000  15.250000
max    15.000000  16.000000  17.000000  18.000000  19.000000

In [113]:
type(b.describe())

pandas.core.frame.DataFrame

In [114]:
b.describe().ix['max']

C:\Users\86186\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    15.0
1    16.0
2    17.0
3    18.0
4    19.0
Name: max, dtype: float64

In [115]:
b.describe()[2]

count     4.000000
mean      9.500000
std       6.454972
min       2.000000
25%       5.750000
50%       9.500000
75%      13.250000
max      17.000000
Name: 2, dtype: float64

In [116]:
b

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [117]:
b.cumsum()

    0   1   2   3   4
c   0   1   2   3   4
a   5   7   9  11  13
d  15  18  21  24  27
b  30  34  38  42  46

In [118]:
b.cumprod()

   0     1     2     3     4
c  0     1     2     3     4
a  0     6    14    24    36
d  0    66   168   312   504
b  0  1056  2856  5616  9576

In [120]:
b.cummin()

   0  1  2  3  4
c  0  1  2  3  4
a  0  1  2  3  4
d  0  1  2  3  4
b  0  1  2  3  4

In [121]:
b.cummax()

    0   1   2   3   4
c   0   1   2   3   4
a   5   6   7   8   9
d  10  11  12  13  14
b  15  16  17  18  19

In [122]:
b.rolling(2).sum()

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   5.0   7.0   9.0  11.0  13.0
d  15.0  17.0  19.0  21.0  23.0
b  25.0  27.0  29.0  31.0  33.0

In [123]:
b.rolling(3).sum()
#与前几行求和结果

      0     1     2     3     4
c   NaN   NaN   NaN   NaN   NaN
a   NaN   NaN   NaN   NaN   NaN
d  15.0  18.0  21.0  24.0  27.0
b  30.0  33.0  36.0  39.0  42.0

In [124]:
hprice = pd.Series([3.04,22.93,12.75,22.6,12.33],index=['2008','2009','2010','2011','2012'])
m2=pd.Series([8.18,18.38,9.13,7.82,6.69],index=['2008','2009','2010','2011','2012'])
hprice.corr(m2)

0.5239439145220387